Documents/ИзменениеЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ИзменениеЛицевогоСчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛицевыеСчета</xr:Item>
				<xr:Item>InformationRegister.ДополнительныеРеквизитыЛицевогоСчета</xr:Item>
				<xr:Item>InformationRegister.МашиноМеста</xr:Item>
				<xr:Item>InformationRegister.ОтветственныйВладелецЛицевогоСчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийИзменениеЛицевогоСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬНомерМашиноМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬКоличествоМашиноМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МашиноМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидМашиноМеста</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыМашиноМест</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерМашиноМеста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМашиноМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительныйРеквизит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеРеквизитыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МашиноМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>МашиноМеста</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерМашиноМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМашиноМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидМашиноМеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМашиноМест</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийИзменениеЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийИзменениеЛицевогоСчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОтветственногоВладельца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеДанныхОПотребителяхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеМашиноМест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеДополнительныхРеквизитов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИзменениеЛицевогоСчета/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Элементы.ГруппаПрописанные.Видимость = ?(Объект.ВидОперации = Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеДанныхОПотребителяхУслуг, Истина, Ложь);
	Элементы.ГруппаСменыОтветственногоВладельца.Видимость = ?(Объект.ВидОперации = Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеОтветственногоВладельца, Истина, Ложь);;
	Элементы.ГруппаМашиноМесто.Видимость = ?(Объект.ВидОперации = Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеМашиноМест, Истина, Ложь);;
	Элементы.ГруппаДополнительныеРеквизиты.Видимость = ?(Объект.ВидОперации = Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеДополнительныхРеквизитов, Истина, Ложь);;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРасширениеНачисленийЛицевыхСчетов") Тогда
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеДополнительныхРеквизитов);	
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

// Функция возвращает физическое лицо.
//
&НаСервереБезКонтекста
Функция ПолучитьФизЛицо(ПотребительУслуг)
	
	Возврат ПотребительУслуг.ФизЛицо;
	
КонецФункции

// Процедура - обработчик команды "ДокументыФизЛиц".
//
&НаКлиенте
Процедура КомандаДокументыФизЛиц(Команда)
	
	Если Элементы.ПотребителиУслуг.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФизЛицо = ПолучитьФизЛицо(Элементы.ПотребителиУслуг.ТекущиеДанные.ПотребительУслуг);
	Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("ФизЛицо", ФизЛицо);
	ПараметрыФизЛицо = Новый Структура("Отбор",СтруктураОтбора);
	ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.Форма.ДокументыФизическогоЛица", ПараметрыФизЛицо);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ВидОперации".
//
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

// Функция возвращает данные о лицевом счете.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеЛицевойСчетПриИзменении(ЛицевойСчет, Дата)
	
	ДатаПред = Дата - (24*60*60);
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить("Организация", ЛицевойСчет.Владелец.Организация);
	СтруктураДанные.Вставить("Здание", ЛицевойСчет.Владелец);

	
	Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
		
		СтруктураДанные.Вставить("ОтветственныйВладелец", Справочники.ПотребителиУслуг.ПустаяСсылка());
		СтруктураДанные.Вставить("КоличествоПрописанных", 0);
		СтруктураДанные.Вставить("КоличествоПроживающих", 0);
		
		Возврат СтруктураДанные;
		
	КонецЕсли;
	
	ТаблицаОтветственныйВладелец = РегистрыСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(ДатаПред, Новый Структура("ЛицевойСчет", ЛицевойСчет));
	
	Если ТаблицаОтветственныйВладелец.Количество() > 0 Тогда
		СтруктураДанные.Вставить("ОтветственныйВладелец", ТаблицаОтветственныйВладелец[0].ОтветственныйВладелец);
	Иначе
		СтруктураДанные.Вставить("ОтветственныйВладелец", Справочники.ПотребителиУслуг.ПустаяСсылка());
	КонецЕсли;
	
	ТаблицаЛицевойСчет = РегистрыСведений.ЛицевыеСчета.СрезПоследних(ДатаПред, Новый Структура("ЛицевойСчет", ЛицевойСчет));
	
	Если ТаблицаЛицевойСчет.Количество() > 0 Тогда
		
		СтруктураДанные.Вставить("КоличествоПрописанных", ТаблицаЛицевойСчет[0].КоличествоПрописанных);
		СтруктураДанные.Вставить("КоличествоПроживающих", ТаблицаЛицевойСчет[0].КоличествоПроживающих);
		
	Иначе	
		СтруктураДанные.Вставить("КоличествоПрописанных", 0);
		СтруктураДанные.Вставить("КоличествоПроживающих", 0);
		
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеЛицевойСчетПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	СтруктураДанные = ПолучитьДанныеЛицевойСчетПриИзменении(Объект.ЛицевойСчет, Объект.Дата);
	
	Объект.Организация = СтруктураДанные.Организация;
	Объект.Здание = СтруктураДанные.Здание;
	ОтветственныйВладелецПред = СтруктураДанные.ОтветственныйВладелец;
	
	КоличествоПрописанныхПред = СтруктураДанные.КоличествоПрописанных;
	КоличествоПроживающихПред = СтруктураДанные.КоличествоПроживающих;
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ЛицевойСчет".
//
&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыВыбораЗначения.Вставить("ОтборЗдание",			Объект.Здание);

	ОткрытьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, Элемент);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	УстановитьВидимостьИДоступность();
	
	СтруктураДанные = ПолучитьДанныеЛицевойСчетПриИзменении(Объект.ЛицевойСчет, Объект.Дата);
	ОтветственныйВладелецПред = СтруктураДанные.ОтветственныйВладелец;
	
	КоличествоПрописанныхПред = СтруктураДанные.КоличествоПрописанных;
	КоличествоПроживающихПред = СтруктураДанные.КоличествоПроживающих;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Объект.ВидОперации = Перечисления.ВидыОперацийИзменениеЛицевогоСчета.ИзменениеМашиноМест Тогда
		ТаблицаМашиноМест = РегистрыСведений.МашиноМеста.СрезПоследних(, Новый Структура("ЛицевойСчет", Объект.ЛицевойСчет));
		
		Объект.МашиноМеста.Очистить();
		
		Для Каждого СтрокаМашиноМест Из ТаблицаМашиноМест Цикл 
			Если СтрокаМашиноМест.КоличествоМашиноМест = 0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Объект.МашиноМеста.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМашиноМест);
		КонецЦикла;
	КонецЕсли; 
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
	Оповестить("ИзмененЛицевойСчет", Объект.ЛицевойСчет , ЭтаФорма);
	
КонецПроцедуры
